# Doc: https://homebrew-file.readthedocs.io/en/latest/usage.html
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "versent/homebrew-taps"
tap "d12frosted/emacs-plus"

brew "awscli"
brew "bash"
brew "bat"
brew "bazel"
brew "curl"
brew "dust"
brew "emacs-plus"
brew "exa"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-delta"
brew "gitui"
brew "gnu-sed"
brew "grep"
brew "groovy"
brew "hyperfine"
brew "mysql"
brew "neovim"
brew "node"
brew "openssl"
brew "pcre"
brew "peco"
brew "pkg-config"
brew "procs"
brew "pyenv"
brew "python@3.8"
brew "r"
brew "ripgrep"
brew "saml2aws"
brew "sbcl"
brew "sd"
brew "starship"
brew "tealdeer"
brew "tectonic"
brew "tmux"
brew "tokei"
brew "unzip"
brew "wget"
brew "yarn"
brew "zsh"

cask "alacritty"
cask "alfred"
cask "alt-tab"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-jetbrains-mono"
cask "font-noto-sans-cjk-jp"
cask "font-noto-serif-cjk-jp"
cask "font-source-code-pro"
cask "google-chrome"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "notion"
cask "obs"
cask "racket"
cask "rstudio"
cask "slack"
cask "spotify"
cask "thunderbird"
cask "visual-studio-code"
cask "vivaldi"
cask "zoomus"
