# Doc: https://homebrew-file.readthedocs.io/en/latest/usage.html
brew tap "d12frosted/emacs-plus"
tap "discoteq/discoteq"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "nrlquaker/createzap"
tap "railwaycat/emacsmacport"
tap "versent/homebrew-taps"
cask_args appdir: "/Applications", require_sha: true

# ===brew===
brew "bash"
brew "bat"
brew "bazel"
brew "buildifier"
brew "ccls"
brew "clang-format"
brew "cmake"
brew "curl"
brew "emacs-mac", args: ["with-modules"]
brew "emacs-plus", args: ["--with-native-comp", "--with-modern-doom3-icon"]
brew "expat"
brew "ffmpeg"
brew "flock"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdb"
brew "gh"
brew "ghc"
brew "ghq"
brew "gibo"
brew "git"
brew "git-delta"
brew "gitui"
brew "gmp"
brew "gnu-sed"
brew "go"
brew "golangci-lint"
brew "gradle"
brew "grep"
brew "haskell-stack"
brew "hyperfine"
brew "isl"
brew "java"
brew "jenv"
brew "jq"
brew "libmpc"
brew "llvm"
brew "make"
brew "mas"
brew "mpfr"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "node"
brew "nvm"
brew "openjdk@11"
brew "openjdk@8"
brew "openssl"
brew "pandoc"
brew "pkg-config"
brew "pyenv"
brew "python@3.9"
brew "readline"
brew "rlwrap"
brew "roswell"
brew "sbcl"
brew "shellcheck"
brew "sqlite3"
brew "starship"
brew "svn"
brew "tealdeer"
brew "tectonic"
brew "tmux"
brew "tokei"
brew "unzip"
brew "wget"
brew "xz"
brew "yarn"
brew "youtube-dl"
brew "zlib"
brew "zsh"
# ===Replacement===
brew "dust" # replacement of du
brew "exa" # replacement of ls
brew "fd" # replacement of find
brew "procs" # replacement of ps
brew "ripgrep" # replacement of grep
brew "sd" # replacement of sed

# ===cask===
cask "alacritty"
cask "alfred"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "dropbox"
cask "firefox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "hhkb-pro-driver"
cask "iterm2"
cask "karabiner-elements"
cask "keybase"
cask "keycastr"
cask "mactex-no-gui"
cask "microsoft-edge"
cask "obs"
cask "shiftit"
cask "slack"
cask "spotify"
cask "typora"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# ===mas===
mas "xcode", id: 497799835
