# Doc: https://homebrew-file.readthedocs.io/en/latest/usage.html
tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "versent/homebrew-taps"
cask_args appdir: "/Applications"

brew "awscli"
brew "bash"
brew "bat"
brew "bazel"
brew "buildifier"
brew "clang-format"
brew "curl"
brew "dust" # replacement of du
brew "emacs-plus"
brew "exa" # replacement of ls
brew "fd" # replacement of find
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-delta"
brew "gitui"
brew "gnu-sed"
brew "go"
brew "grep"
brew "groovy"
brew "heroku"
brew "hyperfine" # for benchmark
brew "jq" # json processor
brew "llvm"
brew "mas"
brew "mysql"
brew "neovim"
brew "node"
brew "openssl"
brew "pkg-config"
brew "procs" # replacement of ps
brew "pyenv"
brew "python@3.9"
brew "r"
brew "ripgrep" # replacement of grep
brew "saml2aws"
brew "sbcl"
brew "sd" # replacement of sed
brew "starship"
brew "svn"
brew "tealdeer"
brew "tectonic"
brew "tmux"
brew "tokei"
brew "unzip"
brew "watchman"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh"

cask "alacritty"
cask "alfred"
cask "alt-tab"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-cascadia-code"
cask "font-jetbrains-mono"
cask "font-noto-sans-cjk-jp"
cask "font-noto-serif-cjk-jp"
cask "font-roboto"
cask "font-source-code-pro"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "keybase"
cask "mactex"
cask "mendeley"
cask "microsoft-edge"
cask "notion"
cask "obs"
cask "racket"
cask "rstudio"
cask "shiftit"
cask "slack"
cask "spotify"
cask "typora"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "zoomus"

mas "papership", id: 686459498
mas "befocuedpro", id: 961632517
mas "pocket", id: 568494494
mas "xcode", id: 497799835
