# Doc: https://homebrew-file.readthedocs.io/en/latest/usage.html
# ===config===
# set arguments for all "brew install --cask" commands
cask_args appdir: "/Applications"

# ===tap===
tap "alexhallam/tidy-viewer"
tap "discoteq/discoteq"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "nrlquaker/createzap"
tap "railwaycat/emacsmacport"
tap "versent/homebrew-taps"
tap "microsoft/git"

# ===brew===
brew "emacs-mac", args: ["with-modern-icon", "with-imagemagic", "with-modules"]
brew "nvm", link: true
brew "pyenv", link: true
brew "reattach-to-user-namespace"
brew "telnet"
brew "vcpkg"

# ===cask===
cask "1password"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "brave-browser"
cask "deepl"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "freedom"
cask "git-credential-manager-core"
cask "gitify"
cask "google-chrome"
cask "google-japanese-ime"
cask "grammarly-desktop"
cask "gtkwave"
cask "hhkb-pro-driver"
cask "intellij-idea-ce"
cask "karabiner-elements"
cask "keybase"
cask "keycastr"
cask "kindle"
cask "microsoft-edge"
cask "notion"
cask "obs"
cask "obsidian"
cask "openaudible"
cask "shiftit"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "zulip"
