# Doc: https://homebrew-file.readthedocs.io/en/latest/usage.html
tap "d12frosted/emacs-plus"
tap "discoteq/discoteq"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "nrlquaker/createzap"
tap "railwaycat/emacsmacport"
tap "versent/homebrew-taps"
cask_args appdir: "/Applications"

# ===brew===
brew "boost"
brew "clang-format"
brew "coreutils"
brew "emacs-plus@28", args: ["with-native-comp", "with-modern-doom3-icon"]
brew "glslang"
brew "java"
brew "jenv"
brew "make"
brew "mas"
brew "nvm"
brew "openjdk@11"
brew "openjdk@8"
brew "pyenv"
brew "reattach-to-user-namespace"

# ===cask===
cask "alfred"
cask "balenaetcher"
cask "discord"
cask "dropbox"
cask "google-cloud-sdk"
cask "firefox"
cask "docker"
cask "google-japanese-ime"
cask "google-chrome"
cask "hhkb-pro-driver"
cask "karabiner-elements"
cask "keybase"
cask "keycastr"
cask "mactex-no-gui"
cask "microsoft-edge"
cask "obs"
cask "shiftit"
cask "slack"
cask "spotify"
cask "texmaker"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# ===mas===
mas "xcode", id: 497799835
