# Doc: https://homebrew-file.readthedocs.io/en/latest/usage.html
# ===config===
# set arguments for all "brew install --cask" commands
cask_args appdir: "/Applications"

# ===tap===
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "microsoft/git" # credential-manager-core
tap "railwaycat/emacsmacport" # emacs-mac
tap "d12frosted/emacs-plus" # emacs-plus

# ===brew===
# brew "emacs-plus", args: ["with-spacemacs-icon", "with-native-comp"]
brew "emacs-plus", args: ["with-spacemacs-icon"]
# brew "emacs-mac", args: ["with-modern-icon", "with-imagemagic", "with-modules", "with-native-comp"]
brew "pyenv", link: true
brew "reattach-to-user-namespace"
brew "telnet"

# ===cask===
cask "1password"
cask "alacritty"
cask "amethyst"
cask "docker"
cask "dropbox"
cask "freedom"
cask "git-credential-manager-core"
cask "gitify"
cask "google-japanese-ime"
cask "grammarly-desktop"
cask "keycastr"
cask "microsoft-edge"
cask "obs"
cask "obsidian"
cask "raycast"
cask "spotify"
cask "tailscale"
cask "visual-studio-code"
